#define _CRT_SECURE_NO_WARNINGS 1
//任务：输入一个数，查找这个数，在一个杨氏矩阵中是否存在
//杨氏矩阵是一类矩阵，他的特征是右边的数字比左边的大，同时下边的数字比上边的大
//如：
//1 2 3
//2 3 4 
//3 4 5 
//杨氏矩阵有一个特点是，右上角的数字永远是最小的，左下角的数字永远是最大的。所以找数字时，我们可以通过与右上角或右下角比较
//轻易舍去一行或者一列。例如这里选择的是与右上角比较，如果查找数字<右上角右上角数字，那么舍去当前列，反之舍去当前行。直到找到数字
//或者舍去所有行列结束。
//用此方法的时间复杂度仅有o（n）
#include<stdio.h>
#define ROW 3
#define COL 3
int main()
{
	int r = 0;
	int c = COL-1;//将行列初始化成指向最右上角
	int a[ROW][COL] = { 1,2,3,2,3,4,3,4,5 };
	int x=0;
	printf("请输入您要查找的数字");
	scanf("%d", &x);
	while (r<=ROW-1&&c>=0)
	{
		if (a[r][c] == x)
		{
			printf("恭喜您，找到了，存在此数字");
			break;
		}
		else if (a[r][c] < x)
		{
			r++;//x更大，舍去行
		}
		else if (a[r][c] > x)
		{
			c--;//x更小，舍去列
		}
	}
	if (!(r < ROW - 1 && c >= 0))//如果循环因舍弃完所有行列退出，则说明没找到
	{
		printf("抱歉找不到您要找的数字");
	}
	return 0;
}